app/controllers/carro_controller.rb

  def index
    carro = Carro.all
---
SELECT "carros".* FROM "carros"

  def show
    carro = Carro.find(params[:id])
---
SELECT "carros".* FROM "carros" WHERE "carros"."id" = 1 LIMIT 1