app/controllers/reloj_controller.rb

  def index
    reloj = Reloj.all
---
SELECT "relojs".* FROM "relojs"

  def show
    reloj = Reloj.find(params[:id])
---
SELECT "relojs".* FROM "relojs" WHERE "relojs"."id" = 1 LIMIT 1